Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/edc/PIC32CM5164LE00100.PIC
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:regionid="userid" edc:beginaddr="0x804008" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:erasepagesize="0x100"/>
    <edc:ConfigFuseSector edc:regionid="BOCOR_FUSES" edc:beginaddr="0x80C004" edc:endaddr="0x80C050" atdf:pagesize="0x40" edc:erasepagesize="0x100">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_1" edc:nzwidth="0x20" edc:impl="0x7FF00" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFE80000" edc:access="-------------nnnnnnnnnnn--------" edc:_addr="0x80C004" edc:default="0xFFE80000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:DCRFieldDef edc:cname="BOOTROM_BOOTPROT" edc:nzwidth="0xB" edc:desc="Boot Protection"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x80C008"/>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_16" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C040" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_0" edc:nzwidth="0x20" edc:desc="Crc Key bits 31:0"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_17" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C044" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_1" edc:nzwidth="0x20" edc:desc="Crc Key bits 63:32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_18" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C048" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_2" edc:nzwidth="0x20" edc:desc="Crc Key bits 95:64"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_19" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C04C" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_3" edc:nzwidth="0x20" edc:desc="Crc Key bits 127:96"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:regionid="HSRAM" edc:beginaddr="0x20000000" edc:endaddr="0x20010000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBA" edc:beginaddr="0x40000000" edc:endaddr="0x40003424" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="WRCTRL" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000100000000000100001" edc:mclr="00000000000000100000000000100001" edc:impl="0xFFFFFF" edc:_addr="0x40000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x10" edc:desc="Peripheral identifier"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Peripheral access control key">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:nzwidth="0x1" edc:desc="Peripheral acess error event output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000005"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000009">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGAHB" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:nzwidth="0x1" edc:desc="FLASH"/>
            <edc:SFRFieldDef edc:cname="APBA_" edc:nzwidth="0x1" edc:desc="APBA"/>
            <edc:SFRFieldDef edc:cname="APBB_" edc:nzwidth="0x1" edc:desc="APBB"/>
            <edc:SFRFieldDef edc:cname="APBC_" edc:nzwidth="0x1" edc:desc="APBC"/>
            <edc:SFRFieldDef edc:cname="HSRAMCPU_" edc:nzwidth="0x1" edc:desc="HSRAMCPU"/>
            <edc:SFRFieldDef edc:cname="HSRAMDMAC_" edc:nzwidth="0x1" edc:desc="HSRAMDMAC"/>
            <edc:SFRFieldDef edc:cname="HSRAMDSU_" edc:nzwidth="0x1" edc:desc="HSRAMDSU"/>
            <edc:SFRFieldDef edc:cname="BROM_" edc:nzwidth="0x1" edc:desc="BROM"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGA" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x40000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGB" edc:nzwidth="0x20" edc:access="--------------------------nnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3E" edc:_addr="0x40000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
