Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/edc/PIC32CM5164LE00100.PIC
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E43C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR16" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="NVIC_IPR17" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000E444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8B8" edc:_addr="0xE000E448"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CPUID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="Revision" edc:nzwidth="0x4" edc:desc="Revision number"/>
            <edc:SFRFieldDef edc:cname="PartNo" edc:nzwidth="0xC" edc:desc="Part number, 0xD20=Cortex-M23"/>
            <edc:SFRFieldDef edc:cname="Architecture" edc:nzwidth="0x4" edc:desc="Architecture version, 0xC=ARMv8-M Base Line, 0xF=ARMv8-M Main Line"/>
            <edc:SFRFieldDef edc:cname="Variant" edc:nzwidth="0x4" edc:desc="Variant number"/>
            <edc:SFRFieldDef edc:cname="Implementer" edc:nzwidth="0x8" edc:desc="Implementer code, ARM=0x41"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="ICSR" edc:nzwidth="0x20" edc:access="nn-nnnn-nn-nnnnnnnnnn--nnnnnnnnn" edc:impl="0xDEDFF9FF" edc:_addr="0xE000ED04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="VECTACTIVE" edc:nzwidth="0x9" edc:desc="Vector active"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RETTOBASE" edc:nzwidth="0x1" edc:desc="Return to base"/>
            <edc:SFRFieldDef edc:cname="VECTPENDING" edc:nzwidth="0x9" edc:desc="Vector pending"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ISRPENDING" edc:nzwidth="0x1" edc:desc="Interrupt pending"/>
            <edc:SFRFieldDef edc:cname="ISRPREEMPT" edc:nzwidth="0x1" edc:desc="Interrupt preempt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDSTCLR" edc:nzwidth="0x1" edc:desc="Pend SysTick clear">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Removes the pending state from the SysTick exception" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSTSET" edc:nzwidth="0x1" edc:desc="Pend SysTick set">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Write: no effect; read: SysTick exception is not pending" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Write: changes SysTick exception state to pending; read: SysTick exception is pending" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSVCLR" edc:nzwidth="0x1" edc:desc="Pend PendSV clear">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Removes the pending state from the PendSV exception" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSVSET" edc:nzwidth="0x1" edc:desc="Pend PendSV set">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Write: no effect; read: PendSV exception is not pending" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Write: changes PendSV exception state to pending; read: PendSV exception is pending" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDNMICLR" edc:nzwidth="0x1" edc:desc="Pend NMI clear"/>
            <edc:SFRFieldDef edc:cname="PENDNMISET" edc:nzwidth="0x1" edc:desc="Pend NMI set">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Write: no effect; read: NMI exception is not pending" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Write: changes NMI exception state to pending; read: NMI exception is pending" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="VTOR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:impl="0xFFFFFF80" edc:_addr="0xE000ED08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TBLOFF" edc:nzwidth="0x19" edc:desc="Vector table base offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="AIRCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnn---------nnn-" edc:impl="0xFFFFE00E" edc:_addr="0xE000ED0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTCLRACTIVE" edc:nzwidth="0x1" edc:desc="Debug: Clear Active State">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Do not clear active state" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Clear active state" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYSRESETREQ" edc:nzwidth="0x1" edc:desc="System Reset Request">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Do not request a system reset" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Request a system reset" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYSRESETREQS" edc:nzwidth="0x1" edc:desc="System Reset Request Secure only">
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="SYSRESETREQ functionality is available to both Security states" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SECURE" edc:desc="SYSRESETREQ functionality is only available to Secure state" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BFHFNMINS" edc:nzwidth="0x1" edc:desc="BusFault, HardFault and NMI Non-secure enable">
              <edc:SFRFieldSemantic edc:cname="SECURE" edc:desc="BusFault, HardFault, and NMI are Secure" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NON_SECURE" edc:desc="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRIS" edc:nzwidth="0x1" edc:desc="Prioritize Secure Exceptions">
              <edc:SFRFieldSemantic edc:cname="SAME" edc:desc="Priority ranges of Secure and Non-secure exceptions are identical" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NS_DEPRIO" edc:desc="Non-secure exceptions are de-prioritized" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENDIANNESS" edc:nzwidth="0x1" edc:desc="Data Endianness, 0=little, 1=big">
              <edc:SFRFieldSemantic edc:cname="LITTLE" edc:desc="Little-endian" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BIG" edc:desc="Big-endian" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VECTKEY" edc:nzwidth="0x10" edc:desc="Register Key (0x05FA)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="SCR" edc:nzwidth="0x20" edc:access="---------------------------nnnn-" edc:impl="0x1E" edc:_addr="0xE000ED10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPONEXIT" edc:nzwidth="0x1" edc:desc="Sleep on exit">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="O not sleep when returning to Thread mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enter sleep, or deep sleep, on return from an ISR" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEP" edc:nzwidth="0x1" edc:desc="Sleep deep">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Deep sleep" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEPS" edc:nzwidth="0x1" edc:desc="Sleep deep secure"/>
            <edc:SFRFieldDef edc:cname="SEVONPEND" edc:nzwidth="0x1" edc:desc="Send Event on Pending bit">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CCR" edc:nzwidth="0x20" edc:access="-------------nnn-----n-n---nn-n-" edc:impl="0x7051A" edc:_addr="0xE000ED14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USERSETMPEND" edc:nzwidth="0x1" edc:desc="User set main pending"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNALIGN_TRP" edc:nzwidth="0x1" edc:desc="Unaligned trap">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIV_0_TRP" edc:nzwidth="0x1" edc:desc="Divide by zero trap"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BFHFNMIGN" edc:nzwidth="0x1" edc:desc="BusFault in HardFault or NMI ignore"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STKOFHFNMIGN" edc:nzwidth="0x1" edc:desc="Stack overflow in HardFault and NMI ignore"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DC" edc:nzwidth="0x1" edc:desc="Data cache enable"/>
            <edc:SFRFieldDef edc:cname="IC" edc:nzwidth="0x1" edc:desc="Instruction cache enable"/>
            <edc:SFRFieldDef edc:cname="BP" edc:nzwidth="0x1" edc:desc="Branch prediction enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000ED18"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="SHPR2" edc:nzwidth="0x20" edc:access="nnnnnnnn------------------------" edc:impl="0xFF000000" edc:_addr="0xE000ED1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="PRI_11" edc:nzwidth="0x8" edc:desc="Priority of system handler 11, SVCall"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="SHPR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0xE000ED20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="PRI_12" edc:nzwidth="0x8" edc:desc="Priority of system handler 12, DebugMonitor"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_14" edc:nzwidth="0x8" edc:desc="Priority of system handler 14, PendSV"/>
            <edc:SFRFieldDef edc:cname="PRI_15" edc:nzwidth="0x8" edc:desc="Priority of system handler 15, SysTick"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
